Revit 2027 API
IPointCloudAccess.Free Method
 Completes the lifetime of the object providing this interface.
Namespace: Autodesk.Revit.DB.PointClouds
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
void Free()
Sub Free
void Free()
abstract Free : unit -> unit
Remarks
 Calling this function indicates that the IPointCloudAccess interface is not going to be used after the call returns, and the provider of the interface can dispose of all allocated resources.
See Also
Reference
IPointCloudAccess Interface
Autodesk.Revit.DB.PointClouds Namespace